const ruTranslations = {
  translation: {
    'Split Bill Easy': 'Делите Счёт Легко!',

    // top navigation
    'Choose language:': 'Выберите язык:',
    'Choose currency:': 'Выберите валюту:',
    'Kazakhstani Tenge': 'Казахстанский Тенге',
    'Russian Ruble': 'Российский Рубль',
    'Belarusian Ruble': 'Белорусский Рубль',
    'Clear Items and Services': 'Очистить Позиции и Подсчёты',
    'Copy link to share app': 'Скопировать ссылку, чтобы поделиться',
    'App Link copied to clipboard': 'Ссылка на приложение скопирована',

    // bottom navigation
    'Payers': 'Участники',
    'Items': 'Позиции',
    'Calculations': 'Подсчёты',

    // payers
    'Name': 'Имя',
    'New name': 'Новое имя',
    'Enter a new name': 'Введите новое имя',

    // items
    'There are no items in your bill. Fill the form below to add it':
      'В счёте нет позиций. Заполните форму ниже, чтобы добавить позицию в счёт',
    'Item': 'Позиция',
    'Enter an item': 'Введите позицию',
    'Item cost': 'Стоимость позиции',
    'Enter an item cost': 'Введите стоимость позиции',
    'Quantity': 'Количество',
    'Enter a quantity': 'Введите количество',
    'Choose who bought this item': 'Выберите кто купил эту позицию',
    'Save': 'Сохранить',
    'Edit': 'Редактировать',
    'Delete': 'Удалить',
    'Total': 'Итого',

    // calculations
    'Calculate after extra charges': 'Рассчитать после дополнительных сборов',
    'Copy to clipboard for everyone': 'Копировать итоговый список',
    'Copy to clipboard for ': 'Копировать список для ',
    'Bill copied to clipboard': 'Счёт скопирован',
    'There are no items in your bill. Fill the form on Items page to add them':
      'В счёте нет позиций. Заполните форму на странице Позиции, чтобы добавить их',

    // copy to clipboard
    'Bill for': 'Счёт для',
    'Total price': 'Итоговая сумма',
    'Instruction to add app to Home screen':
      'Как установить Split Bill Easy, приложение для разделения счета?\n' +
      'Хотя это и не обязательно, вы можете сохранить Split Bill Easy на своем домашнем экране, чтобы сделать его более доступным.\n\n' +
      'Android\n' +
      '1. Откройте Split Bill Easy в браузере (например, Chrome).\n' +
      '2. Нажмите кнопку меню (три точки) в адресной строке.\n' +
      '3. Выберите "Добавить на главный экран".\n' +
      '4. Отредактируйте название, если нужно, и нажмите "Добавить".\n\n' +
      'iOS\n' +
      '1. Откройте Split Bill Easy в Safari.\n' +
      '2. Нажмите кнопку "Поделиться" (иконка со стрелкой внизу).\n' +
      '3. Прокрутите вниз и выберите "Добавить на экран Домой".\n' +
      '4. Отредактируйте название, если нужно, и нажмите "Добавить".\n\n' +
      'Теперь Split Bill Easy доступно на вашем домашнем экране, как обычное приложение.\n',

    // services
    'Service Charge': 'За обслуживание',
    'Tips': 'Чаевые',
    'Discount': 'Скидка',
    'Tax': 'Налог',
    'Percentage': 'Проценты',
    'Fixed': 'Фиксированная сумма',

    // error messages
    'Error: Incorrect amount': 'Ошибка: Некорректная сумма',
    'Item is required': 'Необходимо ввести название позиции',
    'Price is required': 'Нужно указать цену',
    'Quantity is required': 'Нужно указать количество',

    // main instructions
    'Welcome to "Split Bill Easy"!': 'Добро пожаловать в "Делите Счёт Легко"!',
    'Say goodbye to the hassle of dividing restaurant bills! Our app makes it simple and quick:':
      'Забудьте о проблемах с разделением счёта в ресторане! Наше приложение делает это просто и быстро:',
    '1. Payers Tab': '1. Участники',
    "Add everyone who's sharing the bill.": 'Добавьте всех, кто участвует в оплате счета',
    '2. Items Tab': '2. Позиции',
    'Enter each item on the bill, who ordered it, and how the cost is split.':
      'Введите каждую позицию в счете, кто её заказал и как будет разделена стоимость',
    '3. Calculations Tab': '3. Подсчёты',
    'Add any extra charges like service fees or tips. Note: The total amount may be slightly higher than the bill due to rounding.':
      'Добавьте любые дополнительные расходы, такие как плата за обслуживание или чаевые. Обратите внимание: общая сумма может быть немного выше, чем указано в чеке, из-за округления',
    'Then, just copy and share the final breakdown with your friends. Enjoy your meal without the awkward math! 🍽️👍':
      'Затем просто скопируйте и поделитесь итоговым расчетом с друзьями. Наслаждайтесь вашей трапезой без неловких математических расчетов! 🍽️👍',
    "The program's developer is Yuliya Niaverova. If you need an experienced React developer to implement your project, feel free to contact me on LinkedIn.":
      'Разработчик программы - Юлия Неверова. Если вам нужен опытный разработчик React для реализации вашего проекта, не стесняйтесь связаться со мной в LinkedIn.',
    'My LinkedIn account': 'Мой аккаунт LinkedIn',
  },
};

export { ruTranslations };
