const rusTranslations = {
  translation: {
    'Split Bill Easy': 'Делите Счёт Легко!',
    'Welcome to React': 'Добро пожаловать в React и react-i18next',

    // top navigation
    'Choose language:': 'Выберите язык:',
    'English': 'Английский',
    'Russian': 'Русский',
    'Choose currency:': 'Выберите валюту:',
    'Kazakhstani Tenge': 'Казахстанский Тенге',
    'Russian Ruble': 'Российский Рубль',
    'Belarusian Ruble': 'Белорусский Рубль',

    // bottom navigation
    'Payers': 'Участники',
    'Items': 'Позиции',
    'Calculations': 'Подсчёты',

    // payers
    'Name': 'Имя',
    'New name': 'Новое имя',
    'Enter a new name': 'Введите новое имя',

    // items
    'There are no items in your bill. Fill the form below to add it':
      'В счёте нет позиций. Заполните форму ниже, чтобы добавить позицию в счёт',
    'Item': 'Позиция',
    'Enter an item': 'Введите позицию',
    'Item cost': 'Стоимость позиции',
    'Enter an item cost': 'Введите стоимость позиции',
    'Quantity': 'Количество',
    'Enter a quantity': 'Введите количество',
    'Choose who bought this item': 'Выберите кто купил эту позицию',
    'Save': 'Сохранить',
    'Edit': 'Редактировать',
    'Delete': 'Удалить',
    'Calculate after extra charges': 'Рассчитать после дополнительных сборов',
    'Copy to clipboard for everyone': 'Копировать список участников с итоговыми суммами',
    'Copy to clipboard for ': 'Копировать список для ',

    // copy to clipboard
    'Bill for': 'Счёт для',
    'Total price': 'Итоговая сумма',

    // services
    'Service Charge': 'Сервисный сбор',
    'Tips': 'Чаевые',
    'Discount': 'Скидка',
    'Tax': 'Налог',

    // error messages
    'Error: Incorrect amount': 'Ошибка: Некорректная сумма',
    'Item is required': 'Необходимо ввести название позиции',
    'Price is required': 'Нужно указать цену',
    'Quantity is required': 'Нужно указать количество',

    // main instructions
    'Welcome to "Split Bill Easy"!': 'Добро пожаловать в "Делите Счёт Легко"!',
    'Say goodbye to the hassle of dividing restaurant bills! Our app makes it simple and quick:':
      'Забудьте о проблемах с разделением счёта в ресторане! Наше приложение делает это просто и быстро:',
    '1. Payers Tab': '1. Участники',
    "Add everyone who's sharing the bill.": 'Добавьте всех, кто участвует в оплате счета',
    '2. Items Tab': '2. Позиции',
    'Enter each item on the bill, who ordered it, and how the cost is split.':
      'Введите каждую позицию в счете, кто её заказал и как будет разделена стоимость',
    '3. Calculations Tab': '3. Подсчёты',
    'Add any extra charges like service fees or tips.':
      'Добавьте любые дополнительные расходы, включая сервисный сбор или чаевые',
    'Then, just copy and share the final breakdown with your friends. Enjoy your meal without the awkward math! 🍽️👍':
      'Затем просто скопируйте и поделитесь итоговым расчетом с друзьями. Наслаждайтесь вашей трапезой без неловких математических расчетов! 🍽️👍',
    "The program's developer is Yuliya Niaverova. If you need an experienced React developer to implement your project, feel free to contact me on LinkedIn.":
      'Разработчик программы - Юлия Неверова. Если вам нужен опытный разработчик React для реализации вашего проекта, не стесняйтесь связаться со мной в LinkedIn.',
    'My LinkedIn account': 'Мой аккаунт LinkedIn',
  },
};

export { rusTranslations };
